In [42]:
import pandas as pd

In [43]:
students = pd.read_csv("pandas_7.csv")

In [44]:
def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    return students.dropna(subset=["name"])

In [45]:
dropMissingData(students)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14